Revit 2026 API

# ExternalFileUtilsGetFileBasedTempFolder Method

---

Gets a temp folder based on the given file name

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GetFileBasedTempFolder(
	string filename
)
```
```vb
Public Shared Function GetFileBasedTempFolder (
	filename As String
) As String
```
```cpp
public:
static String^ GetFileBasedTempFolder(
	String^ filename
)
```
```fsharp
static member GetFileBasedTempFolder :
        filename : string -> string
```

#### Parameters

filename String

#### Return Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExternalFileUtils Class

Autodesk.Revit.DB Namespace